*** 
# CHAPTER 7. Hierarchical Query
***
### KEY WORD
* start with : 시작행을 지정 (100번사원 반드시 출력)
* connect by 부모행과 자식행의 관계를 지정

## 7-1.  CONNECT BY .. .PRIOR
### < CONNECT BY *PRIOR* employee_id = manager_id >
* top-down 방식 
* start with를 기준으로 부하직원찾기

In [1]:
import cx_Oracle
import pandas as pd
xedb = cx_Oracle.connect('hr/hr@localhost/xe')
cur = xedb.cursor()

In [2]:
df = pd.read_sql("""
        SELECT employee_id, last_name, manager_id
        FROM employees
        START WITH employee_id=100
        CONNECT BY PRIOR employee_id=manager_id
        """,xedb)
print(df)

     EMPLOYEE_ID    LAST_NAME  MANAGER_ID
0            100         King         NaN
1            101      Kochhar       100.0
2            108    Greenberg       101.0
3            109       Faviet       108.0
4            110         Chen       108.0
5            111      Sciarra       108.0
6            112        Urman       108.0
7            113         Popp       108.0
8            200       Whalen       101.0
9            203       Mavris       101.0
10           204         Baer       101.0
11           205      Higgins       101.0
12           206        Gietz       205.0
13           102      De Haan       100.0
14           103       Hunold       102.0
15           104        Ernst       103.0
16           105       Austin       103.0
17           106    Pataballa       103.0
18           107      Lorentz       103.0
19           114     Raphaely       100.0
20           115         Khoo       114.0
21           116        Baida       114.0
22           117       Tobias       114.0
23           118       Himuro       114.0
24           119   Colmenares       114.0
25           120        Weiss       100.0
26           125        Nayer       120.0
27           126  Mikkilineni       120.0
28           127       Landry       120.0
29           128       Markle       120.0
..           ...          ...         ...
77           146     Partners       100.0
78           156         King       146.0
79           157        Sully       146.0
80           158       McEwen       146.0
81           159        Smith       146.0
82           160        Doran       146.0
83           161       Sewall       146.0
84           147    Errazuriz       100.0
85           162      Vishney       147.0
86           163       Greene       147.0
87           164      Marvins       147.0
88           165          Lee       147.0
89           166         Ande       147.0
90           167        Banda       147.0
91           148    Cambrault       100.0
92           168         Ozer       148.0
93           169        Bloom       148.0
94           170          Fox       148.0
95           171        Smith       148.0
96           172        Bates       148.0
97           173        Kumar       148.0
98           149      Zlotkey       100.0
99           174         Abel       149.0
100          175       Hutton       149.0
101          176       Taylor       149.0
102          177   Livingston       149.0
103          178        Grant       149.0
104          179      Johnson       149.0
105          201    Hartstein       100.0
106          202          Fay       201.0

[107 rows x 3 columns]

### < CONNECT BY employee_id = *PRIOR* manager_id >
* bottom up 방식
* start with 기준으로 선임찾기

In [3]:
df = pd.read_sql("""
        SELECT employee_id, last_name, manager_id
        FROM employees
        START WITH employee_id=108
        CONNECT BY employee_id= PRIOR manager_id
        """,xedb)
print(df)

   EMPLOYEE_ID  LAST_NAME  MANAGER_ID
0          108  Greenberg       101.0
1          101    Kochhar       100.0
2          100       King         NaN

## 7-2. LEVEL

In [4]:
df = pd.read_sql("""
        SELECT LEVEL, last_name
        FROM employees
        START WITH employee_id = 100
        CONNECT BY PRIOR employee_id = manager_id
        """,xedb)
print(df)

     LEVEL    LAST_NAME
0        1         King
1        2      Kochhar
2        3    Greenberg
3        4       Faviet
4        4         Chen
5        4      Sciarra
6        4        Urman
7        4         Popp
8        3       Whalen
9        3       Mavris
10       3         Baer
11       3      Higgins
12       4        Gietz
13       2      De Haan
14       3       Hunold
15       4        Ernst
16       4       Austin
17       4    Pataballa
18       4      Lorentz
19       2     Raphaely
20       3         Khoo
21       3        Baida
22       3       Tobias
23       3       Himuro
24       3   Colmenares
25       2        Weiss
26       3        Nayer
27       3  Mikkilineni
28       3       Landry
29       3       Markle
..     ...          ...
77       2     Partners
78       3         King
79       3        Sully
80       3       McEwen
81       3        Smith
82       3        Doran
83       3       Sewall
84       2    Errazuriz
85       3      Vishney
86       3       Greene
87       3      Marvins
88       3          Lee
89       3         Ande
90       3        Banda
91       2    Cambrault
92       3         Ozer
93       3        Bloom
94       3          Fox
95       3        Smith
96       3        Bates
97       3        Kumar
98       2      Zlotkey
99       3         Abel
100      3       Hutton
101      3       Taylor
102      3   Livingston
103      3        Grant
104      3      Johnson
105      2    Hartstein
106      3          Fay

[107 rows x 2 columns]

### < 들여쓰기를 이용한 가공 >

In [5]:
df = pd.read_sql("""
        SELECT last_name||lpad(' ', 2 * LEVEL - 2, ' ')AS ename, LEVEL
        FROM employees
        START WITH employee_id = 100
        CONNECT BY PRIOR employee_id = manager_id
        """,xedb)
print(df)

               ENAME  LEVEL
0               King      1
1          Kochhar        2
2      Greenberg          3
3       Faviet            4
4         Chen            4
5      Sciarra            4
6        Urman            4
7         Popp            4
8         Whalen          3
9         Mavris          3
10          Baer          3
11       Higgins          3
12       Gietz            4
13         De Haan        2
14        Hunold          3
15       Ernst            4
16      Austin            4
17   Pataballa            4
18     Lorentz            4
19        Raphaely        2
20          Khoo          3
21         Baida          3
22        Tobias          3
23        Himuro          3
24    Colmenares          3
25           Weiss        2
26         Nayer          3
27   Mikkilineni          3
28        Landry          3
29        Markle          3
..               ...    ...
77        Partners        2
78          King          3
79         Sully          3
80        McEwen          3
81         Smith          3
82         Doran          3
83        Sewall          3
84       Errazuriz        2
85       Vishney          3
86        Greene          3
87       Marvins          3
88           Lee          3
89          Ande          3
90         Banda          3
91       Cambrault        2
92          Ozer          3
93         Bloom          3
94           Fox          3
95         Smith          3
96         Bates          3
97         Kumar          3
98         Zlotkey        2
99          Abel          3
100       Hutton          3
101       Taylor          3
102   Livingston          3
103        Grant          3
104      Johnson          3
105      Hartstein        2
106          Fay          3

[107 rows x 2 columns]

## 7-3.  ORDER SIBLINGS BY  
같은 부모 아래 형제끼리 정렬

In [6]:
# 일반 ORDER BY로 정렬을 하게 되면 계층구조가 어긋난다.

df = pd.read_sql("""
        SELECT last_name||lpad(' ', 2 * LEVEL - 2, ' ')AS ename, LEVEL
        FROM employees
        START WITH employee_id = 100
        CONNECT BY PRIOR employee_id = manager_id
        ORDER BY last_name
        """,xedb)
print(df)

              ENAME  LEVEL
0          Abel          3
1          Ande          3
2      Atkinson          3
3      Austin            4
4          Baer          3
5         Baida          3
6         Banda          3
7         Bates          3
8          Bell          3
9     Bernstein          3
10       Bissot          3
11        Bloom          3
12         Bull          3
13       Cabrio          3
14      Cambrault        2
15    Cambrault          3
16       Chen            4
17        Chung          3
18   Colmenares          3
19       Davies          3
20        De Haan        2
21    Dellinger          3
22        Dilly          3
23        Doran          3
24      Ernst            4
25      Errazuriz        2
26      Everett          3
27     Faviet            4
28          Fay          3
29       Feeney          3
..              ...    ...
77        Patel          3
78      Perkins          3
79   Philtanker          3
80       Popp            4
81         Rajs          3
82       Raphaely        2
83       Rogers          3
84        Russell        2
85     Sarchand          3
86    Sciarra            4
87          Seo          3
88       Sewall          3
89        Smith          3
90        Smith          3
91       Stiles          3
92     Sullivan          3
93        Sully          3
94       Taylor          3
95       Taylor          3
96       Tobias          3
97       Tucker          3
98      Tuvault          3
99      Urman            4
100      Vargas          3
101     Vishney          3
102       Vollman        2
103       Walsh          3
104         Weiss        2
105      Whalen          3
106       Zlotkey        2

[107 rows x 2 columns]

In [7]:
# ORDER SIBLINGS BY를 이용하여 계층을 유지한 상태로 정렬

df = pd.read_sql("""
        SELECT last_name||lpad(' ', 2 * LEVEL - 2, ' ')AS ename, LEVEL
        FROM employees
        START WITH employee_id = 100
        CONNECT BY PRIOR employee_id = manager_id
        ORDER SIBLINGS BY last_name
        """,xedb)
print(df)

               ENAME  LEVEL
0               King      1
1        Cambrault        2
2          Bates          3
3          Bloom          3
4            Fox          3
5          Kumar          3
6           Ozer          3
7          Smith          3
8          De Haan        2
9         Hunold          3
10      Austin            4
11       Ernst            4
12     Lorentz            4
13   Pataballa            4
14       Errazuriz        2
15          Ande          3
16         Banda          3
17        Greene          3
18           Lee          3
19       Marvins          3
20       Vishney          3
21           Fripp        2
22      Atkinson          3
23        Bissot          3
24          Bull          3
25        Cabrio          3
26     Dellinger          3
27        Marlow          3
28         Olson          3
29      Sarchand          3
..               ...    ...
77     Cambrault          3
78          Hall          3
79         Olsen          3
80        Tucker          3
81       Tuvault          3
82         Vollman        2
83          Bell          3
84       Everett          3
85         Jones          3
86        Ladwig          3
87        McCain          3
88         Patel          3
89           Seo          3
90        Stiles          3
91           Weiss        2
92        Fleaur          3
93         Geoni          3
94        Landry          3
95        Markle          3
96   Mikkilineni          3
97         Nayer          3
98      Sullivan          3
99        Taylor          3
100        Zlotkey        2
101         Abel          3
102        Grant          3
103       Hutton          3
104      Johnson          3
105   Livingston          3
106       Taylor          3

[107 rows x 2 columns]

## 7-4. SYS_CONNECT_BY_PATH 
계층구조 전체경로

In [8]:
df = pd.read_sql("""
        SELECT rpad(sys_connect_by_path(last_name,'/'),32,' ') AS path_1,
                rpad(ltrim(sys_connect_by_path(last_name,'/'),'/'),32,' ') AS path_2
        FROM employees
        START WITH employee_id = 100
        CONNECT BY PRIOR employee_id = manager_id
        """,xedb)
print(df)

                               PATH_1                            PATH_2
0    /King                             King
1    /King/Kochhar                     King/Kochhar
2    /King/Kochhar/Greenberg           King/Kochhar/Greenberg
3    /King/Kochhar/Greenberg/Faviet    King/Kochhar/Greenberg/Faviet
4    /King/Kochhar/Greenberg/Chen      King/Kochhar/Greenberg/Chen
5    /King/Kochhar/Greenberg/Sciarra   King/Kochhar/Greenberg/Sciarra
6    /King/Kochhar/Greenberg/Urman     King/Kochhar/Greenberg/Urman
7    /King/Kochhar/Greenberg/Popp      King/Kochhar/Greenberg/Popp
8    /King/Kochhar/Whalen              King/Kochhar/Whalen
9    /King/Kochhar/Mavris              King/Kochhar/Mavris
10   /King/Kochhar/Baer                King/Kochhar/Baer
11   /King/Kochhar/Higgins             King/Kochhar/Higgins
12   /King/Kochhar/Higgins/Gietz       King/Kochhar/Higgins/Gietz
13   /King/De Haan                     King/De Haan
14   /King/De Haan/Hunold              King/De Haan/Hunold
15   /King/De Haan/Hunold/Ernst        King/De Haan/Hunold/Ernst
16   /King/De Haan/Hunold/Austin       King/De Haan/Hunold/Austin
17   /King/De Haan/Hunold/Pataballa    King/De Haan/Hunold/Pataballa
18   /King/De Haan/Hunold/Lorentz      King/De Haan/Hunold/Lorentz
19   /King/Raphaely                    King/Raphaely
20   /King/Raphaely/Khoo               King/Raphaely/Khoo
21   /King/Raphaely/Baida              King/Raphaely/Baida
22   /King/Raphaely/Tobias             King/Raphaely/Tobias
23   /King/Raphaely/Himuro             King/Raphaely/Himuro
24   /King/Raphaely/Colmenares         King/Raphaely/Colmenares
25   /King/Weiss                       King/Weiss
26   /King/Weiss/Nayer                 King/Weiss/Nayer
27   /King/Weiss/Mikkilineni           King/Weiss/Mikkilineni
28   /King/Weiss/Landry                King/Weiss/Landry
29   /King/Weiss/Markle                King/Weiss/Markle
..                                ...                               ...
77   /King/Partners                    King/Partners
78   /King/Partners/King               King/Partners/King
79   /King/Partners/Sully              King/Partners/Sully
80   /King/Partners/McEwen             King/Partners/McEwen
81   /King/Partners/Smith              King/Partners/Smith
82   /King/Partners/Doran              King/Partners/Doran
83   /King/Partners/Sewall             King/Partners/Sewall
84   /King/Errazuriz                   King/Errazuriz
85   /King/Errazuriz/Vishney           King/Errazuriz/Vishney
86   /King/Errazuriz/Greene            King/Errazuriz/Greene
87   /King/Errazuriz/Marvins           King/Errazuriz/Marvins
88   /King/Errazuriz/Lee               King/Errazuriz/Lee
89   /King/Errazuriz/Ande              King/Errazuriz/Ande
90   /King/Errazuriz/Banda             King/Errazuriz/Banda
91   /King/Cambrault                   King/Cambrault
92   /King/Cambrault/Ozer              King/Cambrault/Ozer
93   /King/Cambrault/Bloom             King/Cambrault/Bloom
94   /King/Cambrault/Fox               King/Cambrault/Fox
95   /King/Cambrault/Smith             King/Cambrault/Smith
96   /King/Cambrault/Bates             King/Cambrault/Bates
97   /King/Cambrault/Kumar             King/Cambrault/Kumar
98   /King/Zlotkey                     King/Zlotkey
99   /King/Zlotkey/Abel                King/Zlotkey/Abel
100  /King/Zlotkey/Hutton              King/Zlotkey/Hutton
101  /King/Zlotkey/Taylor              King/Zlotkey/Taylor
102  /King/Zlotkey/Livingston          King/Zlotkey/Livingston
103  /King/Zlotkey/Grant               King/Zlotkey/Grant
104  /King/Zlotkey/Johnson             King/Zlotkey/Johnson
105  /King/Hartstein                   King/Hartstein
106  /King/Hartstein/Fay               King/Hartstein/Fay

[107 rows x 2 columns]

# [ 연습문제 ]
### (1) 하향식 탐색한 후에 Higgins 사원 제거 후, 하위 행 처리

In [9]:
# 제거 전 11번째 행 Higgins

df = pd.read_sql("""
        SELECT LEVEL, lpad(' ', 2 * LEVEL - 2, ' ') || last_name AS ename
        FROM employees
        START WITH employee_id = 100
        CONNECT BY PRIOR employee_id = manager_id
        """,xedb)
print(df)

     LEVEL            ENAME
0        1             King
1        2          Kochhar
2        3        Greenberg
3        4           Faviet
4        4             Chen
5        4          Sciarra
6        4            Urman
7        4             Popp
8        3           Whalen
9        3           Mavris
10       3             Baer
11       3          Higgins
12       4            Gietz
13       2          De Haan
14       3           Hunold
15       4            Ernst
16       4           Austin
17       4        Pataballa
18       4          Lorentz
19       2         Raphaely
20       3             Khoo
21       3            Baida
22       3           Tobias
23       3           Himuro
24       3       Colmenares
25       2            Weiss
26       3            Nayer
27       3      Mikkilineni
28       3           Landry
29       3           Markle
..     ...              ...
77       2         Partners
78       3             King
79       3            Sully
80       3           McEwen
81       3            Smith
82       3            Doran
83       3           Sewall
84       2        Errazuriz
85       3          Vishney
86       3           Greene
87       3          Marvins
88       3              Lee
89       3             Ande
90       3            Banda
91       2        Cambrault
92       3             Ozer
93       3            Bloom
94       3              Fox
95       3            Smith
96       3            Bates
97       3            Kumar
98       2          Zlotkey
99       3             Abel
100      3           Hutton
101      3           Taylor
102      3       Livingston
103      3            Grant
104      3          Johnson
105      2        Hartstein
106      3              Fay

[107 rows x 2 columns]

In [14]:
df = pd.read_sql_query(
        "SELECT LEVEL, lpad(' ', 2 * LEVEL - 2, ' ') || last_name AS ename\
        FROM employees\
        WHERE last_name != 'Higgins'\
        START WITH employee_id = 100\
        CONNECT BY PRIOR employee_id = manager_id",xedb)
print(df)

     LEVEL            ENAME
0        1             King
1        2          Kochhar
2        3        Greenberg
3        4           Faviet
4        4             Chen
5        4          Sciarra
6        4            Urman
7        4             Popp
8        3           Whalen
9        3           Mavris
10       3             Baer
11       4            Gietz
12       2          De Haan
13       3           Hunold
14       4            Ernst
15       4           Austin
16       4        Pataballa
17       4          Lorentz
18       2         Raphaely
19       3             Khoo
20       3            Baida
21       3           Tobias
22       3           Himuro
23       3       Colmenares
24       2            Weiss
25       3            Nayer
26       3      Mikkilineni
27       3           Landry
28       3           Markle
29       3           Taylor
..     ...              ...
76       2         Partners
77       3             King
78       3            Sully
79       3           McEwen
80       3            Smith
81       3            Doran
82       3           Sewall
83       2        Errazuriz
84       3          Vishney
85       3           Greene
86       3          Marvins
87       3              Lee
88       3             Ande
89       3            Banda
90       2        Cambrault
91       3             Ozer
92       3            Bloom
93       3              Fox
94       3            Smith
95       3            Bates
96       3            Kumar
97       2          Zlotkey
98       3             Abel
99       3           Hutton
100      3           Taylor
101      3       Livingston
102      3            Grant
103      3          Johnson
104      2        Hartstein
105      3              Fay

[106 rows x 2 columns]

Higgins 사원의 하위행인 Gietz 사원이 존재
### (2) Higgins 사원 및 하위 행 모두 제거

In [10]:
df = pd.read_sql("""
        SELECT LEVEL, lpad(' ', 2 * LEVEL - 2, ' ') || last_name AS ename
        FROM employees
        START WITH employee_id = 100
        CONNECT BY PRIOR employee_id = manager_id
        AND last_name != 'Higgins'
        """,xedb)
print(df)

     LEVEL            ENAME
0        1             King
1        2          Kochhar
2        3        Greenberg
3        4           Faviet
4        4             Chen
5        4          Sciarra
6        4            Urman
7        4             Popp
8        3           Whalen
9        3           Mavris
10       3             Baer
11       2          De Haan
12       3           Hunold
13       4            Ernst
14       4           Austin
15       4        Pataballa
16       4          Lorentz
17       2         Raphaely
18       3             Khoo
19       3            Baida
20       3           Tobias
21       3           Himuro
22       3       Colmenares
23       2            Weiss
24       3            Nayer
25       3      Mikkilineni
26       3           Landry
27       3           Markle
28       3           Taylor
29       3           Fleaur
..     ...              ...
75       2         Partners
76       3             King
77       3            Sully
78       3           McEwen
79       3            Smith
80       3            Doran
81       3           Sewall
82       2        Errazuriz
83       3          Vishney
84       3           Greene
85       3          Marvins
86       3              Lee
87       3             Ande
88       3            Banda
89       2        Cambrault
90       3             Ozer
91       3            Bloom
92       3              Fox
93       3            Smith
94       3            Bates
95       3            Kumar
96       2          Zlotkey
97       3             Abel
98       3           Hutton
99       3           Taylor
100      3       Livingston
101      3            Grant
102      3          Johnson
103      2        Hartstein
104      3              Fay

[105 rows x 2 columns]

In [11]:
cur.close()
xedb.close()